package com.hyperskill.example.arithoperat;

import java.util.Scanner;

/**
 * Вам нужно найти квадрат, куб и четвертую степень заданного положительного целого числа. Входные данные будут представлять собой одну строку, содержащую одно положительное целое число (n). Выходные данные должны состоять из трех строк: первая строка выводит квадрат n, следующая строка выводит куб n, а третья строка выводит четвертую степень n.
 */
public class SquareCubeFourth {
    public static void main(String[] args) {
//        Scanner sc = new Scanner(System.in);
//        int n = sc.nextInt();
//        // Compute and print the square of n
//        System.out.println(n * n);
//        // Compute and print the cube of n
//        System.out.println(n * n * n);
//        // Compute and print the fourth power of n
//        System.out.println(n * n * n * n);

        int a = 5 + 7;
        int b = a * 3;
        int c = b / 4;
        int d = b % c;
        System.out.println(d);
    }
}
