package com.hyperskill.ex.fourty.main;

public class CompileMain {

    public static void main(String[] args) {
        System.out.println("We are robots!");
    }


}
/*
Напишите программу Java, которая считывает последовательность показаний температуры в градусах Цельсия до тех пор, пока не будет обнаружено показание 100 градусов или более. Ваша программа должна выводить наивысшее показание температуры, зафиксированное до этого момента. Вы должны принять входные данные в виде последовательности целочисленных значений температуры и вывести наивысшее значение перед условием остановки.
 */